CaptainPotatoes/nRF51-ADS1291-Throughput-Test/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_app_template_main main.c
 * @{
 * @ingroup ble_sdk_app_template
 * @brief Template project main file.
 *
 * This file contains a template for creating a new application. It has the code necessary to wakeup
 * from button, advertise, get a connection restart advertising on disconnect and if no new
 * connection created go back to system-off mode.
 * It can easily be used as a starting point for creating a new application, the comments identified
 * with 'YOUR_JOB' indicates where and how you can customize.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "boards.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "device_manager.h"
#include "pstorage.h"
#include "app_trace.h"
#include "sensorsim.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_dis.h"
#include "ble_bms.h"
#include "app_util_platform.h"
#include "nrf_log.h"
#include "nrf_drv_clock.h"
#include "nrf_delay.h"
/**@ADS1291: **/
#include "ads1291-2.h" /*< For the ADS1291 ECG Chip */
#include "nrf_drv_gpiote.h"
#include "nrf_gpio.h"
/**@BAS: **/
#if (defined(BLE_BAS))
#include "ble_bas.h"
#include "nrf_adc.h"
#endif

//#include "bsp.h"
//#include "bsp_btn_ble.h"


#define IS_SRVC_CHANGED_CHARACT_PRESENT  1                                          /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device*/
#define CENTRAL_LINK_COUNT               0                                          /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT            1                                          /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/
			/**@DEVICE INFO*/
#define DEVICE_NAME                      "EEG 250Hz"                      	    /**< Name of device. Will be included in the advertising data. */
#define DEVICE_NAME_500									 "ECG 500Hz" 
#define DEVICE_NAME_1000								 "ECG 1000Hz"
#define DEVICE_ERROR										 "ECG Other"
#define MANUFACTURER_NAME                "VCU-YEO-VIP"                      				/**< Manufacturer. Will be passed to Device Information Service. */
#define DEVICE_MODEL_NUMBERSTR					 "Version 1.0"
#define DEVICE_FIRMWARE_STRING					 "Version 1.8"
			/**@ADVERTISING INITIALIZATION: */
#define APP_ADV_INTERVAL                 300                                        /**< The advertising interval (in units of 0.625 ms. This value corresponds to 25 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS       0                                        /**< The advertising timeout in units of seconds. */
			/**@TIMER DETAILS:*/
#define APP_TIMER_PRESCALER              0                                          /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE          4                                          /**< Size of timer operation queues. */
			/**@GAP INITIALIZATION:*/
#define MIN_CONN_INTERVAL                MSEC_TO_UNITS(16, UNIT_1_25_MS)//32        /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL                MSEC_TO_UNITS(16, UNIT_1_25_MS)//32        /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY                    0                                          /**< Slave latency. */
#define CONN_SUP_TIMEOUT                 MSEC_TO_UNITS(4000, UNIT_10_MS)            /**< Connection supervisory timeout (4 seconds). */
			/**@CONNPARAMS MODULE:*/
#define FIRST_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY    APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)/**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT     3                                          /**< Number of attempts before giving up the connection parameter negotiation. */
			/**@DEVICEMANAGER_INIT Definitions: */
#define SEC_PARAM_BOND                   1                                          /**< Perform bonding. */
#define SEC_PARAM_MITM                   0                                          /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                   0                                          /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS               0                                          /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES        BLE_GAP_IO_CAPS_NONE                       /**< No I/O capabilities. */
#define SEC_PARAM_OOB                    0                                          /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE           7                                          /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE           16                                         /**< Maximum encryption key size. */
			/**@ERROR MACRO:*/
#define DEAD_BEEF                        0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */
			/**@BLE HANDLES*/
static dm_application_instance_t         m_app_handle;                              /**< Application identifier allocated by device manager */
static uint16_t                          m_conn_handle = BLE_CONN_HANDLE_INVALID;   /**< Handle of the current connection. */
/**@BMS STUFF */
ble_bms_t 															 m_bms;
/**@BAS STUFF */
#if (defined(BLE_BAS))
ble_bas_t																 m_bas;
#endif
/**@GPIOTE */
#if (defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))
static bool															m_drdy = false;
#define DRDY_GPIO_PIN_IN 11
#endif //(defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))
/**@TIMER: -Timer Stuff- */
//APP_TIMER_DEF(m_bms_send_timer_id);
APP_TIMER_DEF(m_battery_timer_id);
//#define TIMER_INTERVAL_UPDATE    		 		APP_TIMER_TICKS(40, APP_TIMER_PRESCALER)//50Hz*10dataPoints
#define BAS_TIMER_INTERVAL							APP_TIMER_TICKS(60000, APP_TIMER_PRESCALER)//every 60s
#define ADC_REF_VOLTAGE_IN_MILLIVOLTS     1200                                     /**< Reference voltage (in millivolts) used by ADC while doing conversion. */
#define ADC_PRE_SCALING_COMPENSATION      3                                        /**< The ADC is configured to use VDD with 1/3 prescaling as input. And hence the result of conversion is to be multiplied by 3 to get the actual value of the battery voltage.*/
#define ADC_RESULT_IN_MILLI_VOLTS(ADC_VALUE)\
        ((((ADC_VALUE) * ADC_REF_VOLTAGE_IN_MILLIVOLTS) / 255) * ADC_PRE_SCALING_COMPENSATION)
/**@Services declared under ble_###*/
static ble_uuid_t m_adv_uuids[] = 
{
		{BLE_UUID_BIOPOTENTIAL_MEASUREMENT_SERVICE, BLE_UUID_TYPE_BLE},
		#if defined(BLE_BAS)
			{BLE_UUID_BATTERY_SERVICE, 									BLE_UUID_TYPE_BLE},
		#endif
		{BLE_UUID_DEVICE_INFORMATION_SERVICE, 			BLE_UUID_TYPE_BLE}
}; /**< Universally unique service identifiers. */

